tutorials/compressible/PBNS/cpbnsLTS/bump/0/T
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 274.9;

boundaryField
{
    INLE1
    {
        type            isentropicTotalTemperature;
        p               p;
	T0              uniform 300.0;
        p0              uniform 101300;
        value           uniform 274.9; 
    }

    PRES2
    {
        type            zeroGradient;
    }

    WALL3
    {
        type            zeroGradient;
    }

    WALL4
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
