tutorials/compressible/PBNS/cpbnsLTS/bump/0/U
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (224.353 0 0);

boundaryField
{
    INLE1
    {

        type            temperatureDirectedInletOutletVelocity;
        inletDirection  uniform (1 0 0);
        phi             phi;
        T               T;
        T0              uniform 300.0;
        cylindricalCCS  no;
        omega           (0 0 0);
        value           uniform (224.353 0 0);
    }

    PRES2
    {
        type            zeroGradient;
    }

    WALL3
    {
        type            slip;
    }

    WALL4
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
