tutorials/compressible/PBNS/cpbnsLTS/bump/0/p
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 74653;

boundaryField
{
    INLE1
    {
        type            fixedValue;
        value           uniform 74653;
    }

    PRES2
    {
        type         zeroGradient;
    }

    WALL3
    {
        type            zeroGradient;
    }

    WALL4
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
