tutorials/compressible/PBNS/cpbnsLTS/bump/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.5 0 -0.1)
    (-0.5 0 -0.1)
    ( 0.5 0 -0.1)
    ( 1.5 0 -0.1)

    (-1.5 1 -0.1)
    (-0.5 1 -0.1)
    ( 0.5 1 -0.1)
    ( 1.5 1 -0.1)

    (-1.5 0  0.1)
    (-0.5 0  0.1)
    ( 0.5 0  0.1)
    ( 1.5 0  0.1)

    (-1.5 1  0.1)
    (-0.5 1  0.1)
    ( 0.5 1  0.1)
    ( 1.5 1  0.1)
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (160 160 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) (160 160 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (160 160 1) simpleGrading (1 1 1)
);

edges
(
    arc 1 2 (0 0.1 -0.1)
    arc 9 10 (0 0.1  0.1)
);

patches
(
    patch INLE1
    (
        (0 8 12 4)
    )

    patch PRES2
    (
        (3 7 15 11)
    )

    wall WALL3
    (
        (4 12 13 5)
        (5 13 14 6)
        (6 14 15 7)
    )

    wall WALL4
    (
        (0 1 9 8)
        (1 2 10 9)
        (2 3 11 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
